RT-Thread/rt-thread/bsp/wch/arm/Libraries/CH32F20x_StdPeriph_Driver/CMSIS/WCH/CH32F20x/Include/ch32f20x.h
#define FSMC_Bank1          ((FSMC_Bank1_TypeDef *) FSMC_Bank1_R_BASE)
#define FSMC_Bank1E         ((FSMC_Bank1E_TypeDef *) FSMC_Bank1E_R_BASE)
#define FSMC_Bank2          ((FSMC_Bank2_TypeDef *) FSMC_Bank2_R_BASE)
#define FSMC_Bank3          ((FSMC_Bank3_TypeDef *) FSMC_Bank3_R_BASE)
#define FSMC_Bank4          ((FSMC_Bank4_TypeDef *) FSMC_Bank4_R_BASE)

#define DBGMCU              ((DBGMCU_TypeDef *) DBGMCU_BASE)

#define OB                  ((OB_TypeDef *) OB_BASE)

/******************************************************************************/
/*                         Peripheral Registers Bits Definition               */
/******************************************************************************/

/******************************************************************************/
/*                        Analog to Digital Converter                         */
/******************************************************************************/

/********************  Bit definition for ADC_STATR register  ********************/
#define  ADC_AWD                        ((uint8_t)0x01)               /* Analog watchdog flag */
#define  ADC_EOC                        ((uint8_t)0x02)               /* End of conversion */
#define  ADC_JEOC                       ((uint8_t)0x04)               /* Injected channel end of conversion */
#define  ADC_JSTRT                      ((uint8_t)0x08)               /* Injected channel Start flag */
#define  ADC_STRT                       ((uint8_t)0x10)               /* Regular channel Start flag */

/*******************  Bit definition for ADC_CTLR1 register  ********************/
#define  ADC_AWDCH                      ((uint32_t)0x0000001F)        /* AWDCH[4:0] bits (Analog watchdog channel select bits) */
#define  ADC_AWDCH_0                    ((uint32_t)0x00000001)        /* Bit 0 */
#define  ADC_AWDCH_1                    ((uint32_t)0x00000002)        /* Bit 1 */
#define  ADC_AWDCH_2                    ((uint32_t)0x00000004)        /* Bit 2 */
#define  ADC_AWDCH_3                    ((uint32_t)0x00000008)        /* Bit 3 */
#define  ADC_AWDCH_4                    ((uint32_t)0x00000010)        /* Bit 4 */

#define  ADC_EOCIE                      ((uint32_t)0x00000020)        /* Interrupt enable for EOC */
#define  ADC_AWDIE                      ((uint32_t)0x00000040)        /* Analog Watchdog interrupt enable */
#define  ADC_JEOCIE                     ((uint32_t)0x00000080)        /* Interrupt enable for injected channels */
#define  ADC_SCAN                       ((uint32_t)0x00000100)        /* Scan mode */
#define  ADC_AWDSGL                     ((uint32_t)0x00000200)        /* Enable the watchdog on a single channel in scan mode */
#define  ADC_JAUTO                      ((uint32_t)0x00000400)        /* Automatic injected group conversion */
#define  ADC_DISCEN                     ((uint32_t)0x00000800)        /* Discontinuous mode on regular channels */
#define  ADC_JDISCEN                    ((uint32_t)0x00001000)        /* Discontinuous mode on injected channels */

#define  ADC_DISCNUM                    ((uint32_t)0x0000E000)        /* DISCNUM[2:0] bits (Discontinuous mode channel count) */
#define  ADC_DISCNUM_0                  ((uint32_t)0x00002000)        /* Bit 0 */
#define  ADC_DISCNUM_1                  ((uint32_t)0x00004000)        /* Bit 1 */
#define  ADC_DISCNUM_2                  ((uint32_t)0x00008000)        /* Bit 2 */

#define  ADC_DUALMOD                    ((uint32_t)0x000F0000)        /* DUALMOD[3:0] bits (Dual mode selection) */
#define  ADC_DUALMOD_0                  ((uint32_t)0x00010000)        /* Bit 0 */
#define  ADC_DUALMOD_1                  ((uint32_t)0x00020000)        /* Bit 1 */
#define  ADC_DUALMOD_2                  ((uint32_t)0x00040000)        /* Bit 2 */
#define  ADC_DUALMOD_3                  ((uint32_t)0x00080000)        /* Bit 3 */

#define  ADC_JAWDEN                     ((uint32_t)0x00400000)        /* Analog watchdog enable on injected channels */
#define  ADC_AWDEN                      ((uint32_t)0x00800000)        /* Analog watchdog enable on regular channels */

/*******************  Bit definition for ADC_CTLR2 register  ********************/
#define  ADC_ADON                       ((uint32_t)0x00000001)        /* A/D Converter ON / OFF */
#define  ADC_CONT                       ((uint32_t)0x00000002)        /* Continuous Conversion */
#define  ADC_CAL                        ((uint32_t)0x00000004)        /* A/D Calibration */
#define  ADC_RSTCAL                     ((uint32_t)0x00000008)        /* Reset Calibration */
#define  ADC_DMA                        ((uint32_t)0x00000100)        /* Direct Memory access mode */
#define  ADC_ALIGN                      ((uint32_t)0x00000800)        /* Data Alignment */

#define  ADC_JEXTSEL                    ((uint32_t)0x00007000)        /* JEXTSEL[2:0] bits (External event select for injected group) */
#define  ADC_JEXTSEL_0                  ((uint32_t)0x00001000)        /* Bit 0 */
#define  ADC_JEXTSEL_1                  ((uint32_t)0x00002000)        /* Bit 1 */
#define  ADC_JEXTSEL_2                  ((uint32_t)0x00004000)        /* Bit 2 */

#define  ADC_JEXTTRIG                   ((uint32_t)0x00008000)        /* External Trigger Conversion mode for injected channels */

#define  ADC_EXTSEL                     ((uint32_t)0x000E0000)        /* EXTSEL[2:0] bits (External Event Select for regular group) */
#define  ADC_EXTSEL_0                   ((uint32_t)0x00020000)        /* Bit 0 */
#define  ADC_EXTSEL_1                   ((uint32_t)0x00040000)        /* Bit 1 */
#define  ADC_EXTSEL_2                   ((uint32_t)0x00080000)        /* Bit 2 */

#define  ADC_EXTTRIG                    ((uint32_t)0x00100000)        /* External Trigger Conversion mode for regular channels */
#define  ADC_JSWSTART                   ((uint32_t)0x00200000)        /* Start Conversion of injected channels */
#define  ADC_SWSTART                    ((uint32_t)0x00400000)        /* Start Conversion of regular channels */
#define  ADC_TSVREFE                    ((uint32_t)0x00800000)        /* Temperature Sensor and VREFINT Enable */

/******************  Bit definition for ADC_SAMPTR1 register  *******************/
#define  ADC_SMP10                      ((uint32_t)0x00000007)        /* SMP10[2:0] bits (Channel 10 Sample time selection) */
#define  ADC_SMP10_0                    ((uint32_t)0x00000001)        /* Bit 0 */
#define  ADC_SMP10_1                    ((uint32_t)0x00000002)        /* Bit 1 */
#define  ADC_SMP10_2                    ((uint32_t)0x00000004)        /* Bit 2 */

