RT-Thread/rt-thread/bsp/wch/arm/Libraries/CH32F20x_StdPeriph_Driver/CMSIS/WCH/CH32F20x/Include/ch32f20x.h
/*******************  Bit definition for CAN_F12R2 register  ******************/
#define  CAN_F12R2_FB0                       ((uint32_t)0x00000001)        /* Filter bit 0 */
#define  CAN_F12R2_FB1                       ((uint32_t)0x00000002)        /* Filter bit 1 */
#define  CAN_F12R2_FB2                       ((uint32_t)0x00000004)        /* Filter bit 2 */
#define  CAN_F12R2_FB3                       ((uint32_t)0x00000008)        /* Filter bit 3 */
#define  CAN_F12R2_FB4                       ((uint32_t)0x00000010)        /* Filter bit 4 */
#define  CAN_F12R2_FB5                       ((uint32_t)0x00000020)        /* Filter bit 5 */
#define  CAN_F12R2_FB6                       ((uint32_t)0x00000040)        /* Filter bit 6 */
#define  CAN_F12R2_FB7                       ((uint32_t)0x00000080)        /* Filter bit 7 */
#define  CAN_F12R2_FB8                       ((uint32_t)0x00000100)        /* Filter bit 8 */
#define  CAN_F12R2_FB9                       ((uint32_t)0x00000200)        /* Filter bit 9 */
#define  CAN_F12R2_FB10                      ((uint32_t)0x00000400)        /* Filter bit 10 */
#define  CAN_F12R2_FB11                      ((uint32_t)0x00000800)        /* Filter bit 11 */
#define  CAN_F12R2_FB12                      ((uint32_t)0x00001000)        /* Filter bit 12 */
#define  CAN_F12R2_FB13                      ((uint32_t)0x00002000)        /* Filter bit 13 */
#define  CAN_F12R2_FB14                      ((uint32_t)0x00004000)        /* Filter bit 14 */
#define  CAN_F12R2_FB15                      ((uint32_t)0x00008000)        /* Filter bit 15 */
#define  CAN_F12R2_FB16                      ((uint32_t)0x00010000)        /* Filter bit 16 */
#define  CAN_F12R2_FB17                      ((uint32_t)0x00020000)        /* Filter bit 17 */
#define  CAN_F12R2_FB18                      ((uint32_t)0x00040000)        /* Filter bit 18 */
#define  CAN_F12R2_FB19                      ((uint32_t)0x00080000)        /* Filter bit 19 */
#define  CAN_F12R2_FB20                      ((uint32_t)0x00100000)        /* Filter bit 20 */
#define  CAN_F12R2_FB21                      ((uint32_t)0x00200000)        /* Filter bit 21 */
#define  CAN_F12R2_FB22                      ((uint32_t)0x00400000)        /* Filter bit 22 */
#define  CAN_F12R2_FB23                      ((uint32_t)0x00800000)        /* Filter bit 23 */
#define  CAN_F12R2_FB24                      ((uint32_t)0x01000000)        /* Filter bit 24 */
#define  CAN_F12R2_FB25                      ((uint32_t)0x02000000)        /* Filter bit 25 */
#define  CAN_F12R2_FB26                      ((uint32_t)0x04000000)        /* Filter bit 26 */
#define  CAN_F12R2_FB27                      ((uint32_t)0x08000000)        /* Filter bit 27 */
#define  CAN_F12R2_FB28                      ((uint32_t)0x10000000)        /* Filter bit 28 */
#define  CAN_F12R2_FB29                      ((uint32_t)0x20000000)        /* Filter bit 29 */
#define  CAN_F12R2_FB30                      ((uint32_t)0x40000000)        /* Filter bit 30 */
#define  CAN_F12R2_FB31                      ((uint32_t)0x80000000)        /* Filter bit 31 */

/*******************  Bit definition for CAN_F13R2 register  ******************/
#define  CAN_F13R2_FB0                       ((uint32_t)0x00000001)        /* Filter bit 0 */
#define  CAN_F13R2_FB1                       ((uint32_t)0x00000002)        /* Filter bit 1 */
#define  CAN_F13R2_FB2                       ((uint32_t)0x00000004)        /* Filter bit 2 */
#define  CAN_F13R2_FB3                       ((uint32_t)0x00000008)        /* Filter bit 3 */
#define  CAN_F13R2_FB4                       ((uint32_t)0x00000010)        /* Filter bit 4 */
#define  CAN_F13R2_FB5                       ((uint32_t)0x00000020)        /* Filter bit 5 */
#define  CAN_F13R2_FB6                       ((uint32_t)0x00000040)        /* Filter bit 6 */
#define  CAN_F13R2_FB7                       ((uint32_t)0x00000080)        /* Filter bit 7 */
#define  CAN_F13R2_FB8                       ((uint32_t)0x00000100)        /* Filter bit 8 */
#define  CAN_F13R2_FB9                       ((uint32_t)0x00000200)        /* Filter bit 9 */
#define  CAN_F13R2_FB10                      ((uint32_t)0x00000400)        /* Filter bit 10 */
#define  CAN_F13R2_FB11                      ((uint32_t)0x00000800)        /* Filter bit 11 */
#define  CAN_F13R2_FB12                      ((uint32_t)0x00001000)        /* Filter bit 12 */
#define  CAN_F13R2_FB13                      ((uint32_t)0x00002000)        /* Filter bit 13 */
#define  CAN_F13R2_FB14                      ((uint32_t)0x00004000)        /* Filter bit 14 */
#define  CAN_F13R2_FB15                      ((uint32_t)0x00008000)        /* Filter bit 15 */
#define  CAN_F13R2_FB16                      ((uint32_t)0x00010000)        /* Filter bit 16 */
#define  CAN_F13R2_FB17                      ((uint32_t)0x00020000)        /* Filter bit 17 */
#define  CAN_F13R2_FB18                      ((uint32_t)0x00040000)        /* Filter bit 18 */
#define  CAN_F13R2_FB19                      ((uint32_t)0x00080000)        /* Filter bit 19 */
#define  CAN_F13R2_FB20                      ((uint32_t)0x00100000)        /* Filter bit 20 */
#define  CAN_F13R2_FB21                      ((uint32_t)0x00200000)        /* Filter bit 21 */
#define  CAN_F13R2_FB22                      ((uint32_t)0x00400000)        /* Filter bit 22 */
#define  CAN_F13R2_FB23                      ((uint32_t)0x00800000)        /* Filter bit 23 */
#define  CAN_F13R2_FB24                      ((uint32_t)0x01000000)        /* Filter bit 24 */
#define  CAN_F13R2_FB25                      ((uint32_t)0x02000000)        /* Filter bit 25 */
#define  CAN_F13R2_FB26                      ((uint32_t)0x04000000)        /* Filter bit 26 */
#define  CAN_F13R2_FB27                      ((uint32_t)0x08000000)        /* Filter bit 27 */
#define  CAN_F13R2_FB28                      ((uint32_t)0x10000000)        /* Filter bit 28 */
#define  CAN_F13R2_FB29                      ((uint32_t)0x20000000)        /* Filter bit 29 */
#define  CAN_F13R2_FB30                      ((uint32_t)0x40000000)        /* Filter bit 30 */
#define  CAN_F13R2_FB31                      ((uint32_t)0x80000000)        /* Filter bit 31 */



/******************************************************************************/
/*                          CRC Calculation Unit                              */
/******************************************************************************/

/*******************  Bit definition for CRC_DATAR register  *********************/
#define  CRC_DATAR_DR                           ((uint32_t)0xFFFFFFFF) /* Data register bits */


/*******************  Bit definition for CRC_IDATAR register  ********************/
#define  CRC_IDR_IDATAR                         ((uint8_t)0xFF)        /* General-purpose 8-bit data register bits */


/********************  Bit definition for CRC_CTLR register  ********************/
#define  CRC_CTLR_RESET                         ((uint8_t)0x01)        /* RESET bit */

/******************************************************************************/
/*                      Digital to Analog Converter                           */
/******************************************************************************/

/********************  Bit definition for DAC_CTLR register  ********************/
#define  DAC_EN1                          ((uint32_t)0x00000001)        /* DAC channel1 enable */
#define  DAC_BOFF1                        ((uint32_t)0x00000002)        /* DAC channel1 output buffer disable */
#define  DAC_TEN1                         ((uint32_t)0x00000004)        /* DAC channel1 Trigger enable */

#define  DAC_TSEL1                        ((uint32_t)0x00000038)        /* TSEL1[2:0] (DAC channel1 Trigger selection) */
#define  DAC_TSEL1_0                      ((uint32_t)0x00000008)        /* Bit 0 */
#define  DAC_TSEL1_1                      ((uint32_t)0x00000010)        /* Bit 1 */
#define  DAC_TSEL1_2                      ((uint32_t)0x00000020)        /* Bit 2 */

#define  DAC_WAVE1                        ((uint32_t)0x000000C0)        /* WAVE1[1:0] (DAC channel1 noise/triangle wave generation enable) */
#define  DAC_WAVE1_0                      ((uint32_t)0x00000040)        /* Bit 0 */
#define  DAC_WAVE1_1                      ((uint32_t)0x00000080)        /* Bit 1 */

