RT-Thread/rt-thread/bsp/wch/arm/Libraries/CH32F20x_StdPeriph_Driver/CMSIS/WCH/CH32F20x/Include/ch32f20x.h
/******************  Bit definition for NVIC_ICER register  *******************/
#define  NVIC_ICER_CLRENA                    ((uint32_t)0xFFFFFFFF)        /* Interrupt clear-enable bits */
#define  NVIC_ICER_CLRENA_0                  ((uint32_t)0x00000001)        /* bit 0 */
#define  NVIC_ICER_CLRENA_1                  ((uint32_t)0x00000002)        /* bit 1 */
#define  NVIC_ICER_CLRENA_2                  ((uint32_t)0x00000004)        /* bit 2 */
#define  NVIC_ICER_CLRENA_3                  ((uint32_t)0x00000008)        /* bit 3 */
#define  NVIC_ICER_CLRENA_4                  ((uint32_t)0x00000010)        /* bit 4 */
#define  NVIC_ICER_CLRENA_5                  ((uint32_t)0x00000020)        /* bit 5 */
#define  NVIC_ICER_CLRENA_6                  ((uint32_t)0x00000040)        /* bit 6 */
#define  NVIC_ICER_CLRENA_7                  ((uint32_t)0x00000080)        /* bit 7 */
#define  NVIC_ICER_CLRENA_8                  ((uint32_t)0x00000100)        /* bit 8 */
#define  NVIC_ICER_CLRENA_9                  ((uint32_t)0x00000200)        /* bit 9 */
#define  NVIC_ICER_CLRENA_10                 ((uint32_t)0x00000400)        /* bit 10 */
#define  NVIC_ICER_CLRENA_11                 ((uint32_t)0x00000800)        /* bit 11 */
#define  NVIC_ICER_CLRENA_12                 ((uint32_t)0x00001000)        /* bit 12 */
#define  NVIC_ICER_CLRENA_13                 ((uint32_t)0x00002000)        /* bit 13 */
#define  NVIC_ICER_CLRENA_14                 ((uint32_t)0x00004000)        /* bit 14 */
#define  NVIC_ICER_CLRENA_15                 ((uint32_t)0x00008000)        /* bit 15 */
#define  NVIC_ICER_CLRENA_16                 ((uint32_t)0x00010000)        /* bit 16 */
#define  NVIC_ICER_CLRENA_17                 ((uint32_t)0x00020000)        /* bit 17 */
#define  NVIC_ICER_CLRENA_18                 ((uint32_t)0x00040000)        /* bit 18 */
#define  NVIC_ICER_CLRENA_19                 ((uint32_t)0x00080000)        /* bit 19 */
#define  NVIC_ICER_CLRENA_20                 ((uint32_t)0x00100000)        /* bit 20 */
#define  NVIC_ICER_CLRENA_21                 ((uint32_t)0x00200000)        /* bit 21 */
#define  NVIC_ICER_CLRENA_22                 ((uint32_t)0x00400000)        /* bit 22 */
#define  NVIC_ICER_CLRENA_23                 ((uint32_t)0x00800000)        /* bit 23 */
#define  NVIC_ICER_CLRENA_24                 ((uint32_t)0x01000000)        /* bit 24 */
#define  NVIC_ICER_CLRENA_25                 ((uint32_t)0x02000000)        /* bit 25 */
#define  NVIC_ICER_CLRENA_26                 ((uint32_t)0x04000000)        /* bit 26 */
#define  NVIC_ICER_CLRENA_27                 ((uint32_t)0x08000000)        /* bit 27 */
#define  NVIC_ICER_CLRENA_28                 ((uint32_t)0x10000000)        /* bit 28 */
#define  NVIC_ICER_CLRENA_29                 ((uint32_t)0x20000000)        /* bit 29 */
#define  NVIC_ICER_CLRENA_30                 ((uint32_t)0x40000000)        /* bit 30 */
#define  NVIC_ICER_CLRENA_31                 ((uint32_t)0x80000000)        /* bit 31 */

/******************  Bit definition for NVIC_ISPR register  *******************/
#define  NVIC_ISPR_SETPEND                   ((uint32_t)0xFFFFFFFF)        /* Interrupt set-pending bits */
#define  NVIC_ISPR_SETPEND_0                 ((uint32_t)0x00000001)        /* bit 0 */
#define  NVIC_ISPR_SETPEND_1                 ((uint32_t)0x00000002)        /* bit 1 */
#define  NVIC_ISPR_SETPEND_2                 ((uint32_t)0x00000004)        /* bit 2 */
#define  NVIC_ISPR_SETPEND_3                 ((uint32_t)0x00000008)        /* bit 3 */
#define  NVIC_ISPR_SETPEND_4                 ((uint32_t)0x00000010)        /* bit 4 */
#define  NVIC_ISPR_SETPEND_5                 ((uint32_t)0x00000020)        /* bit 5 */
#define  NVIC_ISPR_SETPEND_6                 ((uint32_t)0x00000040)        /* bit 6 */
#define  NVIC_ISPR_SETPEND_7                 ((uint32_t)0x00000080)        /* bit 7 */
#define  NVIC_ISPR_SETPEND_8                 ((uint32_t)0x00000100)        /* bit 8 */
#define  NVIC_ISPR_SETPEND_9                 ((uint32_t)0x00000200)        /* bit 9 */
#define  NVIC_ISPR_SETPEND_10                ((uint32_t)0x00000400)        /* bit 10 */
#define  NVIC_ISPR_SETPEND_11                ((uint32_t)0x00000800)        /* bit 11 */
#define  NVIC_ISPR_SETPEND_12                ((uint32_t)0x00001000)        /* bit 12 */
#define  NVIC_ISPR_SETPEND_13                ((uint32_t)0x00002000)        /* bit 13 */
#define  NVIC_ISPR_SETPEND_14                ((uint32_t)0x00004000)        /* bit 14 */
#define  NVIC_ISPR_SETPEND_15                ((uint32_t)0x00008000)        /* bit 15 */
#define  NVIC_ISPR_SETPEND_16                ((uint32_t)0x00010000)        /* bit 16 */
#define  NVIC_ISPR_SETPEND_17                ((uint32_t)0x00020000)        /* bit 17 */
#define  NVIC_ISPR_SETPEND_18                ((uint32_t)0x00040000)        /* bit 18 */
#define  NVIC_ISPR_SETPEND_19                ((uint32_t)0x00080000)        /* bit 19 */
#define  NVIC_ISPR_SETPEND_20                ((uint32_t)0x00100000)        /* bit 20 */
#define  NVIC_ISPR_SETPEND_21                ((uint32_t)0x00200000)        /* bit 21 */
#define  NVIC_ISPR_SETPEND_22                ((uint32_t)0x00400000)        /* bit 22 */
#define  NVIC_ISPR_SETPEND_23                ((uint32_t)0x00800000)        /* bit 23 */
#define  NVIC_ISPR_SETPEND_24                ((uint32_t)0x01000000)        /* bit 24 */
#define  NVIC_ISPR_SETPEND_25                ((uint32_t)0x02000000)        /* bit 25 */
#define  NVIC_ISPR_SETPEND_26                ((uint32_t)0x04000000)        /* bit 26 */
#define  NVIC_ISPR_SETPEND_27                ((uint32_t)0x08000000)        /* bit 27 */
#define  NVIC_ISPR_SETPEND_28                ((uint32_t)0x10000000)        /* bit 28 */
#define  NVIC_ISPR_SETPEND_29                ((uint32_t)0x20000000)        /* bit 29 */
#define  NVIC_ISPR_SETPEND_30                ((uint32_t)0x40000000)        /* bit 30 */
#define  NVIC_ISPR_SETPEND_31                ((uint32_t)0x80000000)        /* bit 31 */

/******************  Bit definition for NVIC_ICPR register  *******************/
#define  NVIC_ICPR_CLRPEND                   ((uint32_t)0xFFFFFFFF)        /* Interrupt clear-pending bits */
#define  NVIC_ICPR_CLRPEND_0                 ((uint32_t)0x00000001)        /* bit 0 */
#define  NVIC_ICPR_CLRPEND_1                 ((uint32_t)0x00000002)        /* bit 1 */
#define  NVIC_ICPR_CLRPEND_2                 ((uint32_t)0x00000004)        /* bit 2 */
#define  NVIC_ICPR_CLRPEND_3                 ((uint32_t)0x00000008)        /* bit 3 */
#define  NVIC_ICPR_CLRPEND_4                 ((uint32_t)0x00000010)        /* bit 4 */
#define  NVIC_ICPR_CLRPEND_5                 ((uint32_t)0x00000020)        /* bit 5 */
#define  NVIC_ICPR_CLRPEND_6                 ((uint32_t)0x00000040)        /* bit 6 */
#define  NVIC_ICPR_CLRPEND_7                 ((uint32_t)0x00000080)        /* bit 7 */
#define  NVIC_ICPR_CLRPEND_8                 ((uint32_t)0x00000100)        /* bit 8 */
#define  NVIC_ICPR_CLRPEND_9                 ((uint32_t)0x00000200)        /* bit 9 */
#define  NVIC_ICPR_CLRPEND_10                ((uint32_t)0x00000400)        /* bit 10 */
#define  NVIC_ICPR_CLRPEND_11                ((uint32_t)0x00000800)        /* bit 11 */
#define  NVIC_ICPR_CLRPEND_12                ((uint32_t)0x00001000)        /* bit 12 */
#define  NVIC_ICPR_CLRPEND_13                ((uint32_t)0x00002000)        /* bit 13 */
#define  NVIC_ICPR_CLRPEND_14                ((uint32_t)0x00004000)        /* bit 14 */
#define  NVIC_ICPR_CLRPEND_15                ((uint32_t)0x00008000)        /* bit 15 */
#define  NVIC_ICPR_CLRPEND_16                ((uint32_t)0x00010000)        /* bit 16 */
#define  NVIC_ICPR_CLRPEND_17                ((uint32_t)0x00020000)        /* bit 17 */
#define  NVIC_ICPR_CLRPEND_18                ((uint32_t)0x00040000)        /* bit 18 */
#define  NVIC_ICPR_CLRPEND_19                ((uint32_t)0x00080000)        /* bit 19 */
#define  NVIC_ICPR_CLRPEND_20                ((uint32_t)0x00100000)        /* bit 20 */
#define  NVIC_ICPR_CLRPEND_21                ((uint32_t)0x00200000)        /* bit 21 */
#define  NVIC_ICPR_CLRPEND_22                ((uint32_t)0x00400000)        /* bit 22 */
#define  NVIC_ICPR_CLRPEND_23                ((uint32_t)0x00800000)        /* bit 23 */
#define  NVIC_ICPR_CLRPEND_24                ((uint32_t)0x01000000)        /* bit 24 */
#define  NVIC_ICPR_CLRPEND_25                ((uint32_t)0x02000000)        /* bit 25 */
#define  NVIC_ICPR_CLRPEND_26                ((uint32_t)0x04000000)        /* bit 26 */
#define  NVIC_ICPR_CLRPEND_27                ((uint32_t)0x08000000)        /* bit 27 */
#define  NVIC_ICPR_CLRPEND_28                ((uint32_t)0x10000000)        /* bit 28 */
#define  NVIC_ICPR_CLRPEND_29                ((uint32_t)0x20000000)        /* bit 29 */
#define  NVIC_ICPR_CLRPEND_30                ((uint32_t)0x40000000)        /* bit 30 */
#define  NVIC_ICPR_CLRPEND_31                ((uint32_t)0x80000000)        /* bit 31 */

/******************  Bit definition for NVIC_IABR register  *******************/
#define  NVIC_IABR_ACTIVE                    ((uint32_t)0xFFFFFFFF)        /* Interrupt active flags */
#define  NVIC_IABR_ACTIVE_0                  ((uint32_t)0x00000001)        /* bit 0 */
#define  NVIC_IABR_ACTIVE_1                  ((uint32_t)0x00000002)        /* bit 1 */
#define  NVIC_IABR_ACTIVE_2                  ((uint32_t)0x00000004)        /* bit 2 */
#define  NVIC_IABR_ACTIVE_3                  ((uint32_t)0x00000008)        /* bit 3 */
#define  NVIC_IABR_ACTIVE_4                  ((uint32_t)0x00000010)        /* bit 4 */
#define  NVIC_IABR_ACTIVE_5                  ((uint32_t)0x00000020)        /* bit 5 */
#define  NVIC_IABR_ACTIVE_6                  ((uint32_t)0x00000040)        /* bit 6 */
#define  NVIC_IABR_ACTIVE_7                  ((uint32_t)0x00000080)        /* bit 7 */
#define  NVIC_IABR_ACTIVE_8                  ((uint32_t)0x00000100)        /* bit 8 */
#define  NVIC_IABR_ACTIVE_9                  ((uint32_t)0x00000200)        /* bit 9 */
#define  NVIC_IABR_ACTIVE_10                 ((uint32_t)0x00000400)        /* bit 10 */
#define  NVIC_IABR_ACTIVE_11                 ((uint32_t)0x00000800)        /* bit 11 */
#define  NVIC_IABR_ACTIVE_12                 ((uint32_t)0x00001000)        /* bit 12 */
#define  NVIC_IABR_ACTIVE_13                 ((uint32_t)0x00002000)        /* bit 13 */
#define  NVIC_IABR_ACTIVE_14                 ((uint32_t)0x00004000)        /* bit 14 */
#define  NVIC_IABR_ACTIVE_15                 ((uint32_t)0x00008000)        /* bit 15 */
#define  NVIC_IABR_ACTIVE_16                 ((uint32_t)0x00010000)        /* bit 16 */
#define  NVIC_IABR_ACTIVE_17                 ((uint32_t)0x00020000)        /* bit 17 */
#define  NVIC_IABR_ACTIVE_18                 ((uint32_t)0x00040000)        /* bit 18 */
#define  NVIC_IABR_ACTIVE_19                 ((uint32_t)0x00080000)        /* bit 19 */
#define  NVIC_IABR_ACTIVE_20                 ((uint32_t)0x00100000)        /* bit 20 */
#define  NVIC_IABR_ACTIVE_21                 ((uint32_t)0x00200000)        /* bit 21 */
#define  NVIC_IABR_ACTIVE_22                 ((uint32_t)0x00400000)        /* bit 22 */
#define  NVIC_IABR_ACTIVE_23                 ((uint32_t)0x00800000)        /* bit 23 */
#define  NVIC_IABR_ACTIVE_24                 ((uint32_t)0x01000000)        /* bit 24 */
#define  NVIC_IABR_ACTIVE_25                 ((uint32_t)0x02000000)        /* bit 25 */
#define  NVIC_IABR_ACTIVE_26                 ((uint32_t)0x04000000)        /* bit 26 */
#define  NVIC_IABR_ACTIVE_27                 ((uint32_t)0x08000000)        /* bit 27 */
#define  NVIC_IABR_ACTIVE_28                 ((uint32_t)0x10000000)        /* bit 28 */
#define  NVIC_IABR_ACTIVE_29                 ((uint32_t)0x20000000)        /* bit 29 */
#define  NVIC_IABR_ACTIVE_30                 ((uint32_t)0x40000000)        /* bit 30 */
#define  NVIC_IABR_ACTIVE_31                 ((uint32_t)0x80000000)        /* bit 31 */

/******************  Bit definition for NVIC_PRI0 register  *******************/
#define  NVIC_IPR0_PRI_0                     ((uint32_t)0x000000FF)        /* Priority of interrupt 0 */
#define  NVIC_IPR0_PRI_1                     ((uint32_t)0x0000FF00)        /* Priority of interrupt 1 */
#define  NVIC_IPR0_PRI_2                     ((uint32_t)0x00FF0000)        /* Priority of interrupt 2 */
#define  NVIC_IPR0_PRI_3                     ((uint32_t)0xFF000000)        /* Priority of interrupt 3 */

/******************  Bit definition for NVIC_PRI1 register  *******************/
#define  NVIC_IPR1_PRI_4                     ((uint32_t)0x000000FF)        /* Priority of interrupt 4 */
#define  NVIC_IPR1_PRI_5                     ((uint32_t)0x0000FF00)        /* Priority of interrupt 5 */
#define  NVIC_IPR1_PRI_6                     ((uint32_t)0x00FF0000)        /* Priority of interrupt 6 */
#define  NVIC_IPR1_PRI_7                     ((uint32_t)0xFF000000)        /* Priority of interrupt 7 */

